<template>
  <div>
    <b-modal
      v-model="showModal"
      title="بیماریاں"
      size="xl"
    >
      <b-container class="content-s">
        <b-row no-gutters class="pt-1">
          <b-col class="ml-2 d-flex justify-content-center" v-for="item in cartItems" :key="item.id">
            <DiseaseCards :cartItem="item"/>
          </b-col>
        </b-row>
      </b-container>
    </b-modal>
  </div>
</template>


<script>
import DiseaseCards from './DiseasesCards';
export default {
  components:{
    DiseaseCards
  },
  props: {
   showModal:Boolean
  },

  data() {
    return {
      cartItems:[
        {
          id : 0,
          item: 'افیڈز',
          src: './../assets/aphids.png',
          des: 'پودوں کی یہ عام بیماری گرم ماحول اور مٹی میں نائٹروجن کے اعلی اجزاء کے ذریعہ لائی جاتی ہے۔',
          cure:'نیم کا تیل افیڈ کی افراتفری کو بڑھنے سے روکنے میں مدد کرسکتا ہے ، خاص طور پر جب کرالر تنوں کی طرف بڑھ رہے ہیں۔ مٹی سے پیدا ہونے والے افیڈس پر قابو پانے کے لئے کیڑے مار دوا صابن کا استعمال نہ کریں۔',
          symptoms:'جڑ افڈس اہم نمی کو چوسنے کے ذریعہ پورے جڑوں کے نظام کو ختم کرتے ہوئے ، مٹی میں پشاچ کی طرح کام کرتی ہیں۔ جب حملہ ہوتا ہے تو ، پودوں کو حیرت انگیز نشوونما ، پھوٹنا اور پیلی پتی کا سامنا کرنا پڑے گا۔',
          audio: './../audio/aphids.mp3'
        },
         {
          id : 1,
          item: 'ایپل-سکیب',
          src: './../assets/apple-scab.jpg',
          des: 'پھلوں اور پتیوں پر خارش کے دھبے دبی ہوئے ہیں اور اس کے بیچ میں مخمل کے بیضہ ہو سکتے ہیں۔',
          cure:'بیماری سے بچنے والی اقسام کو پودے لگانے سے خارش کا انتظام کرنے کا بہترین طریقہ ہے۔ فنگسائڈس کا استعمال سیب کی خارش کو منظم کرنے کے لئے کیا جاسکتا ہے۔ بیماری پر قابو پانے کے لئے فنگسائڈس کے ل sp سپرے کا مناسب وقت کی ضرورت ہے۔',
          symptoms:'سیب کی خارش کی پہلی علامات اکثر نہیں پائی جاتی ہیں۔ ان نشانوں میں بٹی ہوئی اور پکے پتے شامل ہیں جن کے نیچے کے نیچے سیاہ ، سرکلر خارش دھبے ہیں۔',
          audio: './../audio/apple-scab.mp3'
        },
        {
          id : 2,
          item: 'انتھراکنوس',
          src: './../assets/anthracnose.jpg',
          des: 'متاثرہ پودے تنوں ، پتیوں یا پھلوں پر تاریک ، پانی سے بھیگے گھاووں کی نشوونما کرتے ہیں۔',
          cure: 'اپنے باغ میں لگے ہوئے کسی بھی پودوں والے پودوں کو ختم اور تباہ کردیں۔ درختوں کے لئے ، مردہ لکڑی کو کاٹنا اور متاثرہ پتوں کو ختم کردیں۔',
          symptoms:'اینتھریکنوز کی علامات میزبان سے میزبان کے لحاظ سے مختلف ہوتی ہیں ، لیکن عام طور پر ، پتے پر فاسد دھبے اور مردہ علاقے شامل ہوتے ہیں جو اکثر پتوں کی رگوں کی پیروی کرتے ہیں۔',
          audio: './../audio/anthracnose.mp3'
        },
        {
          id : 3,
          item: 'لیف-کرل',
          src: './../assets/leaf-curl.jpg',
          des: 'پچھواڑے آڑو اور نیکٹری کے درختوں کے پھول ، پھل ، پتیوں اور ٹہنوں کو متاثر کرتا ہے۔',
          cure:'لیفکورل کو گندھک یا تانبے پر مبنی فنگسائڈس کا استعمال کرتے ہوئے کنٹرول کیا جاسکتا ہے جو آڑو اور نیکٹرائن پر استعمال کے لیبل لگے ہیں۔ کلیوں کے کھلنے سے عین قبل ، موسم بہار میں ، موسم خزاں میں اور دوبارہ پتے کے 90٪ گرنے کے بعد پورے درخت کو چھڑکیں۔',
          symptoms: 'لیفکرل کی علامات موسم بہار میں ظاہر ہوتی ہیں۔ نشوونما پتے شدید طور پر مسخ ہوجاتے ہیں (گھنے اور پکے ہوجاتے ہیں) ، اور اس میں سرخ یا جامنی رنگ کا کاسٹ ہوتا ہے۔',
          audio: './../audio/leaf-curl.mp3'
        },
        {
          id : 4,
          item: 'رسٹ',
          src: './../assets/rust.jpg',
          des: 'سرخی مائل نارنجی بیضہ عوام بنیادی طور پر نچلے پتے کی سطح پر پائے جاتے ہیں۔',
          cure: 'صبح کے اوقات میں پانی - ہیڈ چھڑکنے والوں سے گریز کرنا - تاکہ پودوں کو دن کے وقت خشک ہونے کا وقت مل سکے۔ ڈرپ ایریگیشن اور سوکرین ہوزیز استعمال کی جاسکتی ہیں پتے کو خشک رکھنے میں مدد کریں۔',
          symptoms: 'پتی زنگ پر صرف پودوں پر حملہ ہوتا ہے۔ اس کی علامتوں کی شناخت دھول ، سرخ ، نارنجی سے سرخی مائل بھوری میوہ دار جسم ہے جو پتی کی سطح پر دکھائی دیتی ہیں۔ ان گھاووں سے متعدد بیضوں کی پیداوار ہوتی ہے ، جو پورے پورے اوپری کو احاطہ کرسکتے ہیں پتی کی سطح پتوں کے مورچا چھڑکنا ہوا اور تیز پانی کے ذریعہ پھیلا ہوا ہے۔',
          audio: './../audio/rust.mp3'
        },
      ]
    }
  }
}
</script>


<style scoped>
.content-s{
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
  }
</style>