<template>
    <div class="containers">
        <b-card>
            <b-card-body class="h-20">
                <b-row>
                    <b-col>
                        <b-img src="/assets/seedGrowOne.jpg"/>
                    </b-col>
                    <b-col>
                        <h4>اپنے بیجوں اور پودوں کی افزائش کرنے کا طریقہ تلاش کرنے سے پہلے ، صحیح بیج سے شروعات کریں۔ اگر آپ اپنے آپریشن کو مصدقہ نامیاتی کے طور پر چلانے کا ارادہ رکھتے ہیں تو ، آپ کو تصدیق شدہ نامیاتی بیج اور انچارجوں کو صرف کچھ استثناء کے ساتھ استعمال کرنے کی ضرورت ہے۔</h4>
                    </b-col>
                </b-row>
                <h4 class="pull-right my-3">بیجوں کو اگنے کے لئے درجہ حرارت ، نمی اور روشنی کی صورتحال درست ہونی چاہئے۔ تمام بیجوں میں انکرن کے لئے درجہ حرارت کی حد ہوتی ہے۔کم سے کم درجہ حرارت سب سے کم درجہ حرارت ہے جس پر بیج موثر طریقے سے اگ سکتا ہے۔زیادہ سے زیادہ درجہ حرارت وہ ہے جس میں بیج انکرن ہوسکتے ہیں۔ اس درجہ حرارت کے اوپر یا اس سے نیچے کی کوئی چیز بھی بیجوں کو نقصان پہنچا سکتی ہے یا انہیں استحکام میں ڈال سکتی ہے۔</h4>
                <h4 class="mt-3">
                    تمام بیجوں کو انکرن تک پہنچنے والے داخلی عمل شروع کرنے کے لئے صحیح نمی کی ضرورت ہوتی ہے۔ کھیت کی مٹی میں عام طور پر یہ کھیت کی صلاحیت کا 50-75 فیصد ہے۔ زیادہ سے زیادہ انکرن کے ل A عمدہ بناوٹ والی بیج اور بیج سے مٹی کا رابطہ ضروری ہے۔ مٹی کے ذرائع ابلاغ میں ہوا کا اخراج انکرننگ جنین اور مٹی کے مابین گیس کا اچھ  تبادلہ کرنے کی اجازت دیتا ہے۔ بیجوں کی سانسیں بھی کسی دوسرے جاندار کی طرح سانس لیتی ہیں۔ انہیں آکسیجن کی ضرورت ہوتی ہے اور کاربن ڈائی آکسائیڈ (CO2) تیار کرتے ہیں۔ اس کاربن ڈائی آکسائیڈ کو بیج سے دور ہونے کے قابل ہونے کی ضرورت ہے۔ اگر اوورٹیرٹنگ یا کمپریشن کی وجہ سے مٹی یا میڈیا اچھی طرح سے ہوا نہیں چل رہا ہے تو ، CO2 کھس نہیں پائے گا اور بیج دم گھٹ سکتا ہے۔
                </h4>
            </b-card-body>
        </b-card>
    </div>
</template>

<script>
    export default {
        name: "SeedsGrow"
    }
</script>

<style scoped>
.containers{
    height: 500px;
    overflow: scroll;
}
</style>